posts/pandas-basics.org
#+BEGIN_COMMENT
.. title: Pandas Basics
.. slug: pandas-basics
.. date: 2018-08-05 12:56:23 UTC-07:00
.. tags: pandas basics
.. category: pandas
.. link: 
.. description: Some introductory pandas stuff.
.. type: text
#+END_COMMENT
#+OPTIONS: ^:{}

* Description

This is a chance to refresh your *pandas* knowledge. You will need to do several [[https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html][=groupby=]]s and [[https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html][=join=]]`s to solve the task. 

* Imports
  This first block is necessary for the code.
#+BEGIN_SRC ipython :session basics :results none
# pandas standard library
import os
import re

# from pypi
import pandas
import numpy
import matplotlib.pyplot as plt

from tabulate import tabulate
#+END_SRC

#+BEGIN_SRC ipython :session basics :results none
get_ipython().run_line_magic('matplotlib', 'inline')
#+END_SRC

 This next block is only relevant on Coursera's server.
#+BEGIN_SRC ipython :session basics :results none
from grader import Grader
#+END_SRC

* The Data
#+BEGIN_SRC ipython :session basics :results none
DATA_FOLDER = '../readonly/final_project_data/'
#+END_SRC

#+BEGIN_SRC ipython :session basics :results none
transactions    = pandas.read_csv(os.path.join(DATA_FOLDER,
                                               'sales_train.csv.gz'))
items           = pandas.read_csv(os.path.join(DATA_FOLDER,
                                               'items.csv'))
item_categories = pandas.read_csv(os.path.join(DATA_FOLDER,
                                               'item_categories.csv'))
shops           = pandas.read_csv(os.path.join(DATA_FOLDER,
                                               'shops.csv'))
#+END_SRC

#+BEGIN_SRC ipython :session basics :results none
frames = dict(transactions=transactions,
              items=items,
              item_categories=item_categories,
              shops=shops)
#+END_SRC

* Data Description

The dataset we loaded is taken from a kaggle competititon. You can find complete data description at the [[https://www.kaggle.com/c/competitive-data-science-final-project/data][competition web page]]. To join the competition use [[https://www.kaggle.com/t/1ea93815dca248e99221df42ebde3540][this link]].

#+BEGIN_QUOTE
You are provided with daily historical sales data. The task is to forecast the total amount of products sold in every shop for the test set. Note that the list of shops and products slightly changes every month. Creating a robust model that can handle such situations is part of the challenge.
#+END_QUOTE

** File descriptions

| File Name             | Description                                                                                  |
|-----------------------+----------------------------------------------------------------------------------------------|
| sales_train.csv       | the training set. Daily historical data from January 2013 to October 2015.                   |
| test.csv              | the test set. You need to forecast the sales for these shops and products for November 2015. |
| sample_submission.csv | a sample submission file in the correct format.                                              |
| items.csv             | supplemental information about the items/products.                                           |
| item_categories.csv   | supplemental information about the items categories.                                         |
| shops.csv             | supplemental information about the shops.                                                    |

** Data Fields

| Column             | Description                                                                                                     |
|--------------------+-----------------------------------------------------------------------------------------------------------------|
| ID                 | an Id that represents a (Shop, Item) tuple within the test set                                                  |
| shop_id            | unique identifier of a shop                                                                                     |
| item_id            | unique identifier of a product                                                                                  |
| item_category_id   | unique identifier of item category                                                                              |
| item_cnt_day       | number of products sold. You are predicting a monthly amount of this measure                                    |
| item_price         | current price of an item                                                                                        |
| date               | date in format dd/mm/yyyy                                                                                       |
| date_block_num     | a consecutive month number, used for convenience. January 2013 is 0, February 2013 is 1,..., October 2015 is 33 |
| item_name          | name of item                                                                                                    |
| shop_name          | name of shop                                                                                                    |
| item_category_name | name of item category                                                                                           |


