posts/pandas-basics/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Some introductory pandas stuff.">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pandas Basics | Notes on Kaggle</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://necromuralist.github.io/Kaggle-Competitions/posts/pandas-basics/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Cloistered Monkey">
<link rel="prev" href="../will-a-gbdt-performance-drop-if-we-remove-the-first-tree/" title="Will a GBDT's performance drop if we remove the first tree?" type="text/html">
<meta property="og:site_name" content="Notes on Kaggle">
<meta property="og:title" content="Pandas Basics">
<meta property="og:url" content="https://necromuralist.github.io/Kaggle-Competitions/posts/pandas-basics/">
<meta property="og:description" content="Some introductory pandas stuff.">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-08-05T12:56:23-07:00">
<meta property="article:tag" content="pandas basics">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-default navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://necromuralist.github.io/Kaggle-Competitions/">

                <span id="blog-title">Notes on Kaggle</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="https://necromuralist.github.io/">The Cloistered Monkey</a>
                </li>
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<!-- Google custom search --><form method="get" action="https://www.google.com/search" class="navbar-form navbar-right" role="search">
<div class="form-group">
<input type="text" name="q" class="form-control" placeholder="Search">
</div>
<button type="submit" class="btn btn-primary">
	<span class="glyphicon glyphicon-search"></span>
</button>
<input type="hidden" name="sitesearch" value="https://necromuralist.github.io/Kaggle-Competitions/">
</form>
<!-- End of custom search -->


            <ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Pandas Basics</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Cloistered Monkey
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2018-08-05T12:56:23-07:00" itemprop="datePublished" title="2018-08-05 12:56">2018-08-05 12:56</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orga8006d5" class="outline-2">
<h2 id="orga8006d5">Description</h2>
<div class="outline-text-2" id="text-orga8006d5">
<p>
This is a chance to refresh your <b>pandas</b> knowledge. You will need to do several <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html"><code>groupby</code></a>s and <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.join.html"><code>join</code></a>`s to solve the task. 
</p>
</div>
</div>

<div id="outline-container-orga70badc" class="outline-2">
<h2 id="orga70badc">Imports</h2>
<div class="outline-text-2" id="text-orga70badc">
<p>
This first block is necessary for the code.
</p>
<div class="highlight"><pre><span></span># pandas standard library
import os
import re

# from pypi
import pandas
import numpy
import matplotlib.pyplot as plt

from tabulate import tabulate
</pre></div>

<div class="highlight"><pre><span></span>get_ipython().run_line_magic('matplotlib', 'inline')
</pre></div>

<p>
This next block is only relevant on Coursera's server.
</p>
<div class="highlight"><pre><span></span>from grader import Grader
</pre></div>
</div>
</div>

<div id="outline-container-orgd8847a3" class="outline-2">
<h2 id="orgd8847a3">The Data</h2>
<div class="outline-text-2" id="text-orgd8847a3">
<div class="highlight"><pre><span></span>DATA_FOLDER = '../readonly/final_project_data/'
</pre></div>

<div class="highlight"><pre><span></span>transactions    = pandas.read_csv(os.path.join(DATA_FOLDER,
					       'sales_train.csv.gz'))
items           = pandas.read_csv(os.path.join(DATA_FOLDER,
					       'items.csv'))
item_categories = pandas.read_csv(os.path.join(DATA_FOLDER,
					       'item_categories.csv'))
shops           = pandas.read_csv(os.path.join(DATA_FOLDER,
					       'shops.csv'))
</pre></div>

<div class="highlight"><pre><span></span>frames = dict(transactions=transactions,
	      items=items,
	      item_categories=item_categories,
	      shops=shops)
</pre></div>
</div>
</div>

<div id="outline-container-org77d5eb2" class="outline-2">
<h2 id="org77d5eb2">Data Description</h2>
<div class="outline-text-2" id="text-org77d5eb2">
<p>
The dataset we loaded is taken from a kaggle competititon. You can find complete data description at the <a href="https://www.kaggle.com/c/competitive-data-science-final-project/data">competition web page</a>. To join the competition use <a href="https://www.kaggle.com/t/1ea93815dca248e99221df42ebde3540">this link</a>.
</p>

<blockquote>
<p>
You are provided with daily historical sales data. The task is to forecast the total amount of products sold in every shop for the test set. Note that the list of shops and products slightly changes every month. Creating a robust model that can handle such situations is part of the challenge.
</p>
</blockquote>
</div>

<div id="outline-container-org3777004" class="outline-3">
<h3 id="org3777004">File descriptions</h3>
<div class="outline-text-3" id="text-org3777004">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">File Name</th>
<th scope="col" class="org-left">Description</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">sales_train.csv</td>
<td class="org-left">the training set. Daily historical data from January 2013 to October 2015.</td>
</tr>
<tr>
<td class="org-left">test.csv</td>
<td class="org-left">the test set. You need to forecast the sales for these shops and products for November 2015.</td>
</tr>
<tr>
<td class="org-left">sample_submission.csv</td>
<td class="org-left">a sample submission file in the correct format.</td>
</tr>
<tr>
<td class="org-left">items.csv</td>
<td class="org-left">supplemental information about the items/products.</td>
</tr>
<tr>
<td class="org-left">item_categories.csv</td>
<td class="org-left">supplemental information about the items categories.</td>
</tr>
<tr>
<td class="org-left">shops.csv</td>
<td class="org-left">supplemental information about the shops.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf6d51b5" class="outline-3">
<h3 id="orgf6d51b5">Data Fields</h3>
<div class="outline-text-3" id="text-orgf6d51b5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-left">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">Column</th>
<th scope="col" class="org-left">Description</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">ID</td>
<td class="org-left">an Id that represents a (Shop, Item) tuple within the test set</td>
</tr>
<tr>
<td class="org-left">shop_id</td>
<td class="org-left">unique identifier of a shop</td>
</tr>
<tr>
<td class="org-left">item_id</td>
<td class="org-left">unique identifier of a product</td>
</tr>
<tr>
<td class="org-left">item_category_id</td>
<td class="org-left">unique identifier of item category</td>
</tr>
<tr>
<td class="org-left">item_cnt_day</td>
<td class="org-left">number of products sold. You are predicting a monthly amount of this measure</td>
</tr>
<tr>
<td class="org-left">item_price</td>
<td class="org-left">current price of an item</td>
</tr>
<tr>
<td class="org-left">date</td>
<td class="org-left">date in format dd/mm/yyyy</td>
</tr>
<tr>
<td class="org-left">date_block_num</td>
<td class="org-left">a consecutive month number, used for convenience. January 2013 is 0, February 2013 is 1,…, October 2015 is 33</td>
</tr>
<tr>
<td class="org-left">item_name</td>
<td class="org-left">name of item</td>
</tr>
<tr>
<td class="org-left">shop_name</td>
<td class="org-left">name of shop</td>
</tr>
<tr>
<td class="org-left">item_category_name</td>
<td class="org-left">name of item category</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
