posts/pandas-basics.org
* The First Problem

Let's start with a simple task. 


Print the shape of the loaded dataframes and use the [[https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html][=df.head=]] function to print several rows. Examine the features you are given.

#+BEGIN_SRC ipython :session basics :results output raw :exports both
print("| DataFrame | Rows| Columns|")
print("|-+-+-|")
for name, frame in frames.items():
    rows, columns = frame.shape
    print("|{}| {}|{}|".format(name, rows, columns))
#+END_SRC

#+RESULTS:
| DataFrame       |    Rows | Columns |
|-----------------+---------+---------|
| transactions    | 2935849 |       6 |
| items           |   22170 |       3 |
| item_categories |      84 |       2 |
| shops           |      60 |       2 |

#+BEGIN_SRC ipython :session basics :results output raw :exports both
for name, frame in frames.items():
    print("** {}".format(name))
    head = frame.head()
    print(tabulate(head, headers="keys", tablefmt="orgtbl", showindex=False))
#+END_SRC

#+RESULTS:
** transactions
| date       |   date_block_num |   shop_id |   item_id |   item_price |   item_cnt_day |
|------------+------------------+-----------+-----------+--------------+----------------|
| 02.01.2013 |                0 |        59 |     22154 |       999    |              1 |
| 03.01.2013 |                0 |        25 |      2552 |       899    |              1 |
| 05.01.2013 |                0 |        25 |      2552 |       899    |             -1 |
| 06.01.2013 |                0 |        25 |      2554 |      1709.05 |              1 |
| 15.01.2013 |                0 |        25 |      2555 |      1099    |              1 |
** items
| item_name                                                            |   item_id |   item_category_id |
|----------------------------------------------------------------------+-----------+--------------------|
| ! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.)         D                            |         0 |                 40 |
| !ABBYY FineReader 12 Professional Edition Full [PC, Цифровая версия] |         1 |                 76 |
| ***В ЛУЧАХ СЛАВЫ   (UNV)                    D                        |         2 |                 40 |
| ***ГОЛУБАЯ ВОЛНА  (Univ)                      D                      |         3 |                 40 |
| ***КОРОБКА (СТЕКЛО)                       D                          |         4 |                 40 |
** item_categories
| item_category_name      |   item_category_id |
|-------------------------+--------------------|
| PC - Гарнитуры/Наушники |                  0 |
| Аксессуары - PS2        |                  1 |
| Аксессуары - PS3        |                  2 |
| Аксессуары - PS4        |                  3 |
| Аксессуары - PSP        |                  4 |
** shops
| shop_name                      |   shop_id |
|--------------------------------+-----------|
| !Якутск Орджоникидзе, 56 фран  |         0 |
| !Якутск ТЦ "Центральный" фран  |         1 |
| Адыгея ТЦ "Мега"               |         2 |
| Балашиха ТРК "Октябрь-Киномир" |         3 |
| Волжский ТЦ "Волга Молл"       |         4 |

Unexpectedly, the names are all in [[https://en.wikipedia.org/wiki/Cyrillic_script][cyrillic]], so I guess this will be a black-box in more ways than is usual

* Questions
** Question 1: *What was the maximum total revenue among all the shops in September, 2014?*

From here on out *revenue* refers to total sales minus value of goods returned.

   - Sometimes items are returned, find such examples in the dataset. 
   - It is handy to split `date` field into [`day`, `month`, `year`] components and use ` df.year == 14` and `df.month == 9` in order to select target subset of dates.
   - You may work with `date` feature as with srings, or you may first convert it to ` pd.datetime` type with `pd.to_datetime` function, but do not forget to set correct ` ormat` argument.

*** Answer
**** Sales Per Item

First I'll add a column with the total revenue for each item (the price times the number sold).

#+BEGIN_SRC ipython :session basics :results none
transactions["item_revenue"] = transactions.item_price * transactions.item_cnt_day
#+END_SRC

#+BEGIN_SRC ipython :session basics :results output raw :exports both
print(transactions.describe())
#+END_SRC

#+RESULTS:
       date_block_num       shop_id       item_id    item_price  item_cnt_day  \
count    2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06   
mean     1.456991e+01  3.300173e+01  1.019723e+04  8.908532e+02  1.242641e+00   
std      9.422988e+00  1.622697e+01  6.324297e+03  1.729800e+03  2.618834e+00   
min      0.000000e+00  0.000000e+00  0.000000e+00 -1.000000e+00 -2.200000e+01   
25%      7.000000e+00  2.200000e+01  4.476000e+03  2.490000e+02  1.000000e+00   
50%      1.400000e+01  3.100000e+01  9.343000e+03  3.990000e+02  1.000000e+00   
75%      2.300000e+01  4.700000e+01  1.568400e+04  9.990000e+02  1.000000e+00   
max      3.300000e+01  5.900000e+01  2.216900e+04  3.079800e+05  2.169000e+03   

       item_revenue  
count  2.935849e+06  
mean   1.157732e+03  
std    5.683604e+03  
min   -6.897000e+04  
25%    2.490000e+02  
50%    4.490000e+02  
75%    1.078200e+03  
max    1.829990e+06  

I don't know why one item lost 68970 in whatever currency this represents (presumably rubles), but I assume this means the item had some returns.

