posts/pandas-basics/index.html


<div id="outline-container-orgc16edbe" class="outline-2">
<h2 id="orgc16edbe">The First Problem</h2>
<div class="outline-text-2" id="text-orgc16edbe">
<p>
Let's start with a simple task. 
</p>


<p>
Print the shape of the loaded dataframes and use the <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.head.html"><code>df.head</code></a> function to print several rows. Examine the features you are given.
</p>

<div class="highlight"><pre><span></span>print("| DataFrame | Rows| Columns|")
print("|-+-+-|")
for name, frame in frames.items():
    rows, columns = frame.shape
    print("|{}| {}|{}|".format(name, rows, columns))
</pre></div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">DataFrame</th>
<th scope="col" class="org-right">Rows</th>
<th scope="col" class="org-right">Columns</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">transactions</td>
<td class="org-right">2935849</td>
<td class="org-right">6</td>
</tr>
<tr>
<td class="org-left">items</td>
<td class="org-right">22170</td>
<td class="org-right">3</td>
</tr>
<tr>
<td class="org-left">item_categories</td>
<td class="org-right">84</td>
<td class="org-right">2</td>
</tr>
<tr>
<td class="org-left">shops</td>
<td class="org-right">60</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
<div class="highlight"><pre><span></span>for name, frame in frames.items():
    print("** {}".format(name))
    head = frame.head()
    print(tabulate(head, headers="keys", tablefmt="orgtbl", showindex=False))
</pre></div>
</div>
<div id="outline-container-org960dcf5" class="outline-3">
<h3 id="org960dcf5">transactions</h3>
<div class="outline-text-3" id="text-org960dcf5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">date_block_num</th>
<th scope="col" class="org-right">shop_id</th>
<th scope="col" class="org-right">item_id</th>
<th scope="col" class="org-right">item_price</th>
<th scope="col" class="org-right">item_cnt_day</th>
</tr></thead>
<tbody>
<tr>
<td class="org-right">02.01.2013</td>
<td class="org-right">0</td>
<td class="org-right">59</td>
<td class="org-right">22154</td>
<td class="org-right">999</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-right">03.01.2013</td>
<td class="org-right">0</td>
<td class="org-right">25</td>
<td class="org-right">2552</td>
<td class="org-right">899</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-right">05.01.2013</td>
<td class="org-right">0</td>
<td class="org-right">25</td>
<td class="org-right">2552</td>
<td class="org-right">899</td>
<td class="org-right">-1</td>
</tr>
<tr>
<td class="org-right">06.01.2013</td>
<td class="org-right">0</td>
<td class="org-right">25</td>
<td class="org-right">2554</td>
<td class="org-right">1709.05</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-right">15.01.2013</td>
<td class="org-right">0</td>
<td class="org-right">25</td>
<td class="org-right">2555</td>
<td class="org-right">1099</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb6a8fbf" class="outline-3">
<h3 id="orgb6a8fbf">items</h3>
<div class="outline-text-3" id="text-orgb6a8fbf">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">item_name</th>
<th scope="col" class="org-right">item_id</th>
<th scope="col" class="org-right">item_category_id</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.)         D</td>
<td class="org-right">0</td>
<td class="org-right">40</td>
</tr>
<tr>
<td class="org-left">!ABBYY FineReader 12 Professional Edition Full [PC, Цифровая версия]</td>
<td class="org-right">1</td>
<td class="org-right">76</td>
</tr>
<tr>
<td class="org-left">***В ЛУЧАХ СЛАВЫ   (UNV)                    D</td>
<td class="org-right">2</td>
<td class="org-right">40</td>
</tr>
<tr>
<td class="org-left">***ГОЛУБАЯ ВОЛНА  (Univ)                      D</td>
<td class="org-right">3</td>
<td class="org-right">40</td>
</tr>
<tr>
<td class="org-left">***КОРОБКА (СТЕКЛО)                       D</td>
<td class="org-right">4</td>
<td class="org-right">40</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7900a2e" class="outline-3">
<h3 id="org7900a2e">item_categories</h3>
<div class="outline-text-3" id="text-org7900a2e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">item_category_name</th>
<th scope="col" class="org-right">item_category_id</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">PC - Гарнитуры/Наушники</td>
<td class="org-right">0</td>
</tr>
<tr>
<td class="org-left">Аксессуары - PS2</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">Аксессуары - PS3</td>
<td class="org-right">2</td>
</tr>
<tr>
<td class="org-left">Аксессуары - PS4</td>
<td class="org-right">3</td>
</tr>
<tr>
<td class="org-left">Аксессуары - PSP</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org964e870" class="outline-3">
<h3 id="org964e870">shops</h3>
<div class="outline-text-3" id="text-org964e870">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup>
<col class="org-left">
<col class="org-right">
</colgroup>
<thead><tr>
<th scope="col" class="org-left">shop_name</th>
<th scope="col" class="org-right">shop_id</th>
</tr></thead>
<tbody>
<tr>
<td class="org-left">!Якутск Орджоникидзе, 56 фран</td>
<td class="org-right">0</td>
</tr>
<tr>
<td class="org-left">!Якутск ТЦ "Центральный" фран</td>
<td class="org-right">1</td>
</tr>
<tr>
<td class="org-left">Адыгея ТЦ "Мега"</td>
<td class="org-right">2</td>
</tr>
<tr>
<td class="org-left">Балашиха ТРК "Октябрь-Киномир"</td>
<td class="org-right">3</td>
</tr>
<tr>
<td class="org-left">Волжский ТЦ "Волга Молл"</td>
<td class="org-right">4</td>
</tr>
</tbody>
</table>
<p>
Unexpectedly, the names are all in <a href="https://en.wikipedia.org/wiki/Cyrillic_script">cyrillic</a>, so I guess this will be a black-box in more ways than is usual
</p>
</div>
</div>
</div>

<div id="outline-container-orgf6c6dcc" class="outline-2">
<h2 id="orgf6c6dcc">Questions</h2>
<div class="outline-text-2" id="text-orgf6c6dcc">
</div>
<div id="outline-container-org1111c6c" class="outline-3">
<h3 id="org1111c6c">Question 1: <b>What was the maximum total revenue among all the shops in September, 2014?</b>
</h3>
<div class="outline-text-3" id="text-org1111c6c">
<p>
From here on out <b>revenue</b> refers to total sales minus value of goods returned.
</p>

<ul class="org-ul">
<li>Sometimes items are returned, find such examples in the dataset.</li>
<li>It is handy to split `date` field into [`day`, `month`, `year`] components and use ` df.year <code>= 14` and `df.month =</code> 9` in order to select target subset of dates.</li>
<li>You may work with `date` feature as with srings, or you may first convert it to ` pd.datetime` type with `pd.to_datetime` function, but do not forget to set correct ` ormat` argument.</li>
</ul>
</div>

<div id="outline-container-org7011516" class="outline-4">
<h4 id="org7011516">Answer</h4>
<div class="outline-text-4" id="text-org7011516">
</div>
<ul class="org-ul">
<li>
<a id="orga93108f"></a>Sales Per Item<br><div class="outline-text-5" id="text-orga93108f">
<p>
First I'll add a column with the total revenue for each item (the price times the number sold).
</p>

<div class="highlight"><pre><span></span>transactions["item_revenue"] = transactions.item_price * transactions.item_cnt_day
</pre></div>

<div class="highlight"><pre><span></span>print(transactions.describe())
</pre></div>

<p>
       date_block_num       shop_id       item_id    item_price  item_cnt_day  \
count    2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06   
mean     1.456991e+01  3.300173e+01  1.019723e+04  8.908532e+02  1.242641e+00   
std      9.422988e+00  1.622697e+01  6.324297e+03  1.729800e+03  2.618834e+00   
min      0.000000e+00  0.000000e+00  0.000000e+00 -1.000000e+00 -2.200000e+01   
25%      7.000000e+00  2.200000e+01  4.476000e+03  2.490000e+02  1.000000e+00   
50%      1.400000e+01  3.100000e+01  9.343000e+03  3.990000e+02  1.000000e+00   
75%      2.300000e+01  4.700000e+01  1.568400e+04  9.990000e+02  1.000000e+00   
max      3.300000e+01  5.900000e+01  2.216900e+04  3.079800e+05  2.169000e+03   
</p>

<p>
       item_revenue  
count  2.935849e+06  
mean   1.157732e+03  
std    5.683604e+03  
min   -6.897000e+04  
25%    2.490000e+02  
50%    4.490000e+02  
75%    1.078200e+03  
max    1.829990e+06  
</p>

<p>
I don't know why one item lost 68970 in whatever currency this represents (presumably rubles), but I assume this means the item had some returns.
</p>
</div>
</li>

<li>
