posts/pandas-basics.org
**** Filter Out the Month
    We could convert the dates to datetime objects, but in this case it might be easier to match the =mm.yyyy= date format instead.

#+BEGIN_SRC ipython :session basics :results none
expression = r"\d{2}\.09\.2014"

def matched(date, expression=expression):
    """checks if the string matches our expected date

    Args:
     date: date string formatted dd.mm.yyyy
     expression: regular expression to match

    Returns:
     bool: True if it matches the expression
    """
    return re.match(expression, date) is not None
#+END_SRC

First, as a sanity check, we'll make sure that all the date cells have values.

#+BEGIN_SRC ipython :session basics :results none
assert not transactions.date.hasnans
#+END_SRC

Naw let's filter on the date-expression we created for september.

#+BEGIN_SRC ipython :session basics :results output raw :exports both
september = transactions[transactions.date.apply(matched)]
print(matching.shape)
#+END_SRC

#+RESULTS:
(73157, 7)

That seems like a lot of transactions. What fraction of the total is it?

#+BEGIN_SRC ipython :session basics :results output raw :exports both
rows, columns = september.shape
print("{:.2f} %".format(100 * rows/transactions.shape[0]))
#+END_SRC

#+RESULTS:
2.49 %

Not as much as I would have thought, =transactions= is much larger than I first took it to be.

#+BEGIN_SRC ipython :session basics :results output raw :exports both
grouped = september.groupby(["shop_id", "item_id"])
summed = grouped.item_revenue.agg(numpy.sum)
print(summed.head())
#+END_SRC

#+RESULTS:
shop_id  item_id
2        32          298.0
         33          199.0
         482        6600.0
         485         300.0
         486         300.0
Name: item_revenue, dtype: float64


#+BEGIN_SRC ipython :session basics :results none
max_revenue = # PUT YOUR ANSWER IN THIS VARIABLE
#+END_SRC

grader.submit_tag('max_revenue', max_revenue)


# Great! Let's move on and answer another question:
# 
# <ol start="2">
#   <li><b>What item category generated the highest revenue in summer 2014?</b></li>
# </ol>
# 
# * Submit `id` of the category found.
#     
# * Here we call "summer" the period from June to August.
# 
# *Hints:*
# 
# * Note, that for an object `x` of type `pd.Series`: `x.argmax()` returns **index** of the maximum element. `pd.Series` can have non-trivial index (not `[1, 2, 3, ... ]`).

# In[ ]:


# YOUR CODE GOES HERE

category_id_with_max_revenue = # PUT YOUR ANSWER IN THIS VARIABLE
grader.submit_tag('category_id_with_max_revenue', category_id_with_max_revenue)


# <ol start="3">
#   <li><b>How many items are there, such that their price stays constant (to the best of our knowledge) during the whole period of time?</b></li>
# </ol>
# 
# * Let's assume, that the items are returned for the same price as they had been sold.

# In[ ]:


# YOUR CODE GOES HERE

num_items_constant_price = # PUT YOUR ANSWER IN THIS VARIABLE
grader.submit_tag('num_items_constant_price', num_items_constant_price)


# Remember, the data can sometimes be noisy.

# <ol start="4">
#   <li><b>What was the variance of the number of sold items per day sequence for the shop with `shop_id = 25` in December, 2014? Do not count the items, that were sold but returned back later.</b></li>
# </ol>
# 
# * Fill `total_num_items_sold` and `days` arrays, and plot the sequence with the code below.
# * Then compute variance. Remember, there can be differences in how you normalize variance (biased or unbiased estimate, see [link](https://math.stackexchange.com/questions/496627/the-difference-between-unbiased-biased-estimator-variance)). Compute ***unbiased*** estimate (use the right value for `ddof` argument in `pd.var` or `np.var`). 

# In[ ]:


shop_id = 25

total_num_items_sold = # YOUR CODE GOES HERE
days = # YOUR CODE GOES HERE

# Plot it
plt.plot(days, total_num_items_sold)
plt.ylabel('Num items')
plt.xlabel('Day')
plt.title("Daily revenue for shop_id = 25")
plt.show()

total_num_items_sold_var = # PUT YOUR ANSWER IN THIS VARIABLE
grader.submit_tag('total_num_items_sold_var', total_num_items_sold_var)


# ## Authorization & Submission
# To submit assignment to Cousera platform, please, enter your e-mail and token into the variables below. You can generate token on the programming assignment page. *Note:* Token expires 30 minutes after generation.

# In[ ]:


STUDENT_EMAIL = # EMAIL HERE
STUDENT_TOKEN = # TOKEN HERE
grader.status()


# In[ ]:


grader.submit(STUDENT_EMAIL, STUDENT_TOKEN)


# Well done! :)
